amazonwebservices.aws-toolkit-vscode
anysphere.cursorpyright
anysphere.remote-containers
anysphere.remote-ssh
charliermarsh.ruff
davidanson.vscode-markdownlint
eamodio.gitlens
editorconfig.editorconfig
hediet.vscode-drawio
janisdd.vscode-edit-csv
mechatroner.rainbow-csv
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.python
ms-toolsai.jupyter
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode.live-server
nextflow.nextflow
openai.chatgpt
posit.shiny
quarto.quarto
rdebugger.r-debugger
reditorsupport.r
reditorsupport.r-syntax
remcohaszing.schemastore
sonarsource.sonarlint-vscode
tamasfe.even-better-toml
tomoki1207.pdf
usernamehw.errorlens
yzhang.markdown-all-in-one
