{{ if eq .flavor "work" -}}
# packages/Brewfile.work — applied only when flavor == "work".
# brew bundle is tolerant: if IT or you pre-installed any cask/MAS app,
# bundle skips it with a warning rather than failing.

# ===== Taps =====
# Trust for supabase/tap is set in
# .chezmoiscripts/run_onchange_20-install-brews.sh.tmpl before bundle runs,
# otherwise Homebrew silently skips formulae from untrusted taps.
tap "supabase/tap"
tap "hashicorp/tap"

# ===== Comms / collaboration =====
cask "slack"
cask "microsoft-teams"
cask "zoom"

# ===== IDEs / editors =====
cask "cursor"
cask "visual-studio-code"

# ===== Infra =====
# docker-desktop (formerly the "docker" cask). Its install needs sudo to symlink
# /usr/local/bin/docker, so it only completes in an interactive `brew`/bootstrap
# run — a non-interactive `chezmoi apply` will log it as failed (non-fatal).
cask "docker-desktop"
brew "kubectl"
# terraform was removed from homebrew-core after HashiCorp's BUSL relicense;
# it now lives in HashiCorp's own tap (trusted in the install-brews script).
brew "hashicorp/tap/terraform"
brew "helm"

# ===== Scientific / data =====
brew "r"
brew "postgresql@14"

# ===== Bioinformatics =====
brew "bedtools"
brew "blast"
brew "fastqc"
brew "kraken2"
brew "nextflow"

# ===== Dev tooling =====
cask "ngrok"
brew "supabase/tap/supabase"

# ===== Misc =====
brew "speedtest-cli"

# ===== Notes / docs =====
cask "obsidian"

# ===== Mac App Store apps =====
mas "Microsoft Outlook",    id: 985367838
mas "Microsoft Word",       id: 462054704
mas "Microsoft Excel",      id: 462058435
mas "Microsoft PowerPoint", id: 462062816
{{- end }}
