{{ if eq .flavor "work" -}}
# packages/Brewfile.work — applied only when flavor == "work".
# brew bundle is tolerant: if IT or you pre-installed any cask/MAS app,
# bundle skips it with a warning rather than failing.

# ===== Comms / collaboration =====
cask "slack"
cask "microsoft-teams"
cask "zoom"

# ===== IDEs / editors =====
cask "cursor"
cask "visual-studio-code"

# ===== Infra =====
cask "docker"
brew "kubectl"
brew "terraform"
brew "helm"

# ===== Bioinformatics =====
brew "bedtools"
brew "blast"
brew "fastqc"
brew "kraken2"
brew "nextflow"

# ===== Notes / docs =====
cask "obsidian"

# ===== Mac App Store apps =====
mas "Microsoft Outlook",    id: 985367838
mas "Microsoft Word",       id: 462054704
mas "Microsoft Excel",      id: 462058435
mas "Microsoft PowerPoint", id: 462062816
{{- end }}
